
export interface HistoryItem {
    id: number;
    title: string;
    description: string;
    image: string;
    reverse: boolean;
}

export const historyItems: HistoryItem[] = [
    {
        id: 1,
        title: 'ОСНОВАНИЕ',
        description: 'Центральный московский ипподром основали в 1834 году. Он расположен на территории бывшего Ходынского поля по адресу Беговая улица, дом 22, и является старейшим в России и первым в мире рысистым ипподромом.',
        image: '/images/1.webp',
        reverse: false,
    },
    {
        id: 2,
        title: 'ПЕРЕСТРОЙКА',
        description: 'До 1930 года рысистый и скаковой ипподромы в Москве были раздельными и находились неподалеку друг от друга. В связи с реконструкцией железнодорожного узла Белорусского вокзала встал вопрос о перестройке или переносе скакового ипподрома. Проект слияния двух ипподромов в один – комбинированный – был осуществлен в 1930 году.',
        image: '/images/2.webp',
        reverse: true,
    },
    {
        id: 3,
        title: 'ВОВ',
        description: 'В период Великой Отечественной войны лошади были эвакуированы в другие города. На территории ипподрома находились позиции зенитчиков, охранявших небо Москвы от вражеских налетов, а на дорожках проходили подготовку пехотные части. Около 100 сотрудников Центрального Московского ипподрома ушли на фронт добровольцами.',
        image: '/images/3.webp',
        reverse: false,
    },
    {
        id: 4,
        title: '1950-Е ГОДЫ',
        description: 'В своем нынешнем виде комплекс объектов ипподрома сформировался в 1950-е годы. Главный корпус и пилоны ворот с конными скульптурами являются объектами культурного наследия регионального значения. Вплоть до конца 1980-х годов это было одно из самых оживленных мест отдыха в столице.',
        image: '/images/4.webp',
        reverse: true,
    },
    {
        id: 5,
        title: 'РЕКОРДЫ',
        description: 'С 1970 по 1983 год на Центральном московском ипподроме рысистые лошади установили более 50 новых всесоюзных рекордов и один абсолютный рекорд.',
        image: '/images/5.webp',
        reverse: false,
    },
    {
        id: 6,
        title: 'УПАДОК',
        description: 'С 1992 года бега не проводились и возобновились только в 2000-е, но в существенно меньших масштабах, чем в период расцвета. Из-за недостаточности текущего финансирования и вложений в инфраструктуру ипподром стал постепенно приходить в упадок.',
        image: '/images/6.webp',
        reverse: true,
    },
];
